# Installing MySQL COnnector

In [51]:
# !python -m pip install mysql-connector-python

In [52]:
import mysql.connector

new_db = mysql.connector.connect(
    host= "localhost",
    user= "root",
    password = "mysql1110",
    database = "firstDB"
)
print(new_db)

<mysql.connector.connection.MySQLConnection object at 0x000001EB40D644F0>

# Creating a Database

In [53]:
f_cursor = new_db.cursor()
f_cursor.execute('CREATE DATABASE IF NOT EXISTS firstDB')

# Check if a database exists

In [54]:
f_cursor= new_db.cursor()
f_cursor.execute("SHOW DATABASES")

for i in f_cursor:
    print(i)

('firstdb',)
('information_schema',)
('mysql',)
('performance_schema',)
('sys',)

# Creating Tables and Showing Data

In [55]:
f_cursor.execute("CREATE TABLE students (name VARCHAR(255), code VARCHAR(255))")

ProgrammingError: 1050 (42S01): Table 'students' already exists

# List all tables in firstDB databse

In [ ]:
f_cursor = new_db.cursor()
f_cursor.execute("SHOW TABLES")

for j in f_cursor:
    print(j)

('students',)

# Add PRIMARY KEY when creating table

In [ ]:
f_cursor.execute("CREATE TABLE clients (id INT AUTO_INCREMENT PRIMARY KEY, name VARCHAR(255), code VARCHAR(255))")

# Add PRIMARY KEY if table alredy exists

In [ ]:
f_cursor.execute("ALTER TABLE students ADD COLUMN id INT AUTO_INCREMENT PRIMARY KEY")

# Inserting data into tables

In [ ]:
new_sql = "INSERT INTO students (name, code) VALUES (%s, %s)"
new_vals = ("Ronaldo", "CODE12")

f_cursor.execute(new_sql, new_vals)
new_db.commit()

print(f_cursor.rowcount, "new record inserted")

1 new record inserted

# Inserting many records into tables

In [ ]:
new_sql = "INSERT INTO students (name, code) VALUES (%s, %s)"
new_vals= [
    ("Messi", "CODE30"),
    ("Pogba", "CODE06"),
    ("Salah", "CODE11"),
    ("Fahad", "CODE22")
]

f_cursor.executemany(new_sql, new_vals)
new_db.commit()

print(f_cursor.rowcount, "records inserted")

4 records inserted

# Select Table's data

In [ ]:
f_cursor.execute("SELECT * FROM students")
new_data = f_cursor.fetchall()

for i in new_data:
    print(i)

('Ronaldo', 'CODE12', 1)
('Messi', 'CODE30', 2)
('Pogba', 'CODE06', 3)
('Salah', 'CODE11', 4)
('Fahad', 'CODE22', 5)
('Messi', 'CODE30', 6)
('Pogba', 'CODE06', 7)
('Salah', 'CODE11', 8)
('Fahad', 'CODE22', 9)

# Select data from columns

In [56]:
f_cursor.execute("SELECT name, code FROM students")
new_data = f_cursor.fetchall()

for i in new_data:
    print(i)

('Ronaldo', 'CODE12')
('Messi', 'CODE30')
('Pogba', 'CODE06')
('Salah', 'CODE11')
('Fahad', 'CODE22')
('Messi', 'CODE30')
('Pogba', 'CODE06')
('Salah', 'CODE11')
('Fahad', 'CODE22')

Get the first record

In [ ]:
f_cursor.execute("SELECT * FROM students")
new_data = f_cursor.fetchone()

print(new_data)

('Ronaldo', 'CODE12', 1)

# Filter the result

In [58]:
new_sql = "SELECT * FROM students WHERE name = 'Messi'"

f_cursor.execute(new_sql)
new_data = f_cursor.fetchall()

for i in new_data:
    print(i)

('Messi', 'CODE30', 2)
('Messi', 'CODE30', 6)

# Wildcard characters (%)

In [59]:
new_sql = "SELECT * FROM students WHERE name LIKE '%mes%'"

f_cursor.execute(new_sql)
new_data = f_cursor.fetchall()

for i in new_data:
    print(i)

('Messi', 'CODE30', 2)
('Messi', 'CODE30', 6)

# Sorting results

In [60]:
# new_sql = "SELECT * FROM students ORDER BY name" #ascending
new_sql = "SELECT * FROM students ORDER BY name DESC" #descending
f_cursor.execute(new_sql)

new_data = f_cursor.fetchall()

for i in new_data:
    print(i)

('Salah', 'CODE11', 4)
('Salah', 'CODE11', 8)
('Ronaldo', 'CODE12', 1)
('Pogba', 'CODE06', 3)
('Pogba', 'CODE06', 7)
('Messi', 'CODE30', 2)
('Messi', 'CODE30', 6)
('Fahad', 'CODE22', 5)
('Fahad', 'CODE22', 9)

# Deleting records

In [61]:
new_sql = "DELETE FROM students WHERE name = %s"
name = ("Pogba",) #to prevent sql injection
f_cursor.execute(new_sql, name)

new_db.commit()

print(f_cursor.rowcount, "records deleted from firstDB")

2 records deleted from firstDB

# Deleting table

In [62]:
new_sql = "DROP TABLE IF EXISTS clients"

f_cursor.execute(new_sql)

# Updating table

In [63]:
new_sql = "UPDATE students SET code = %s WHERE code = %s"
new_vals = ("CODE07", "CODE11")
f_cursor.execute(new_sql, new_vals)

new_db.commit()

print(f_cursor.rowcount, "record changed in students table")

2 record changed in students table

# Limit the records

In [64]:
new_sql = "SELECT * FROM students LIMIT 4"
f_cursor.execute(new_sql)
new_data = f_cursor.fetchall()

for i in new_data:
    print(i)

('Ronaldo', 'CODE12', 1)
('Messi', 'CODE30', 2)
('Salah', 'CODE07', 4)
('Fahad', 'CODE22', 5)

In [65]:
new_sql = "SELECT * FROM students LIMIT 3 OFFSET 4"
f_cursor.execute(new_sql)
new_data = f_cursor.fetchall()

for i in new_data:
    print(i)

('Messi', 'CODE30', 6)
('Salah', 'CODE07', 8)
('Fahad', 'CODE22', 9)